from django.core.management.base import BaseCommand
from documents.models import Country, Government, ComType, DocType, DecreeCategory

Countries = [
    ('Afghanistan', 'أفغانستان'),
    ('Albania', 'ألبانيا'),
    ('Algeria', 'الجزائر'),
    ('Andorra', 'أندورا'),
    ('Angola', 'أنغولا'),
    ('Antigua and Barbuda', 'أنتيغوا وباربودا'),
    ('Argentina', 'الأرجنتين'),
    ('Armenia', 'أرمينيا'),
    ('Australia', 'أستراليا'),
    ('Austria', 'النمسا'),
    ('Azerbaijan', 'أذربيجان'),
    ('Bahamas', 'باهاماس'),
    ('Bahrain', 'البحرين'),
    ('Bangladesh', 'بنغلاديش'),
    ('Barbados', 'بربادوس'),
    ('Belarus', 'بيلاروسيا'),
    ('Belgium', 'بلجيكا'),
    ('Belize', 'بليز'),
    ('Benin', 'بنين'),
    ('Bhutan', 'بوتان'),
    ('Bolivia', 'بوليفيا'),
    ('Bosnia and Herzegovina', 'البوسنة والهرسك'),
    ('Botswana', 'بوتسوانا'),
    ('Brazil', 'البرازيل'),
    ('Brunei', 'بروناي'),
    ('Bulgaria', 'بلغاريا'),
    ('Burkina Faso', 'بوركينا فاسو'),
    ('Burundi', 'بوروندي'),
    ('Cabo Verde', 'كابو فيردي'),
    ('Cambodia', 'كمبوديا'),
    ('Cameroon', 'الكاميرون'),
    ('Canada', 'كندا'),
    ('Central African Republic', 'جمهورية أفريقيا الوسطى'),
    ('Chad', 'تشاد'),
    ('Chile', 'تشيلي'),
    ('China', 'الصين'),
    ('Colombia', 'كولومبيا'),
    ('Comoros', 'جزر القمر'),
    ('Congo (Congo-Brazzaville)', 'جمهورية الكونغو'),
    ('Costa Rica', 'كوستاريكا'),
    ('Croatia', 'كرواتيا'),
    ('Cuba', 'كوبا'),
    ('Cyprus', 'قبرص'),
    ('Czechia (Czech Republic)', 'تشيكيا'),
    ('Denmark', 'الدنمارك'),
    ('Djibouti', 'جيبوتي'),
    ('Dominica', 'دومينيكا'),
    ('Dominican Republic', 'جمهورية الدومينيكان'),
    ('Ecuador', 'الإكوادور'),
    ('Egypt', 'مصر'),
    ('El Salvador', 'السلفادور'),
    ('Equatorial Guinea', 'غينيا الاستوائية'),
    ('Eritrea', 'إريتريا'),
    ('Estonia', 'إستونيا'),
    ('Eswatini', 'إسواتيني'),
    ('Ethiopia', 'إثيوبيا'),
    ('Fiji', 'فيجي'),
    ('Finland', 'فنلندا'),
    ('France', 'فرنسا'),
    ('Gabon', 'الغابون'),
    ('Gambia', 'غامبيا'),
    ('Georgia', 'جورجيا'),
    ('Germany', 'ألمانيا'),
    ('Ghana', 'غانا'),
    ('Greece', 'اليونان'),
    ('Grenada', 'غرينادا'),
    ('Guatemala', 'غواتيمالا'),
    ('Guinea', 'غينيا'),
    ('Guinea-Bissau', 'غينيا بيساو'),
    ('Guyana', 'غيانا'),
    ('Haiti', 'هايتي'),
    ('Honduras', 'هندوراس'),
    ('Hungary', 'المجر'),
    ('Iceland', 'آيسلندا'),
    ('India', 'الهند'),
    ('Indonesia', 'إندونيسيا'),
    ('Iran', 'إيران'),
    ('Iraq', 'العراق'),
    ('Ireland', 'أيرلندا'),
    ('Italy', 'إيطاليا'),
    ('Jamaica', 'جامايكا'),
    ('Japan', 'اليابان'),
    ('Jordan', 'الأردن'),
    ('Kazakhstan', 'كازاخستان'),
    ('Kenya', 'كينيا'),
    ('Kiribati', 'كيريباتي'),
    ('Kuwait', 'الكويت'),
    ('Kyrgyzstan', 'قيرغيزستان'),
    ('Laos', 'لاوس'),
    ('Latvia', 'لاتفيا'),
    ('Lebanon', 'لبنان'),
    ('Lesotho', 'ليسوتو'),
    ('Liberia', 'ليبيريا'),
    ('Libya', 'ليبيا'),
    ('Liechtenstein', 'ليختنشتاين'),
    ('Lithuania', 'ليتوانيا'),
    ('Luxembourg', 'لوكسمبورغ'),
    ('Madagascar', 'مدغشقر'),
    ('Malawi', 'مالاوي'),
    ('Malaysia', 'ماليزيا'),
    ('Maldives', 'جزر المالديف'),
    ('Mali', 'مالي'),
    ('Malta', 'مالطا'),
    ('Marshall Islands', 'جزر مارشال'),
    ('Mauritania', 'موريتانيا'),
    ('Mauritius', 'موريشيوس'),
    ('Mexico', 'المكسيك'),
    ('Micronesia', 'ميكرونيسيا'),
    ('Moldova', 'مولدوفا'),
    ('Monaco', 'موناكو'),
    ('Mongolia', 'منغوليا'),
    ('Montenegro', 'الجبل الأسود'),
    ('Morocco', 'المغرب'),
    ('Mozambique', 'موزمبيق'),
    ('Myanmar (Burma)', 'ميانمار'),
    ('Namibia', 'ناميبيا'),
    ('Nauru', 'ناورو'),
    ('Nepal', 'نيبال'),
    ('Netherlands', 'هولندا'),
    ('New Zealand', 'نيوزيلندا'),
    ('Nicaragua', 'نيكاراغوا'),
    ('Niger', 'النيجر'),
    ('Nigeria', 'نيجيريا'),
    ('North Korea', 'كوريا الشمالية'),
    ('North Macedonia', 'مقدونيا الشمالية'),
    ('Norway', 'النرويج'),
    ('Oman', 'عُمان'),
    ('Pakistan', 'باكستان'),
    ('Palau', 'بالاو'),
    ('Palestine', 'فلسطين'),
    ('Panama', 'بنما'),
    ('Papua New Guinea', 'بابوا غينيا الجديدة'),
    ('Paraguay', 'باراغواي'),
    ('Peru', 'بيرو'),
    ('Philippines', 'الفلبين'),
    ('Poland', 'بولندا'),
    ('Portugal', 'البرتغال'),
    ('Qatar', 'قطر'),
    ('Romania', 'رومانيا'),
    ('Russia', 'روسيا'),
    ('Rwanda', 'رواندا'),
    ('Saint Kitts and Nevis', 'سانت كيتس ونيفيس'),
    ('Saint Lucia', 'سانت لوسيا'),
    ('Saint Vincent and the Grenadines', 'سانت فنسنت والغرينادين'),
    ('Samoa', 'ساموا'),
    ('San Marino', 'سان مارينو'),
    ('Sao Tome and Principe', 'ساو تومي وبرينسيبي'),
    ('Saudi Arabia', 'المملكة العربية السعودية'),
    ('Senegal', 'السنغال'),
    ('Serbia', 'صربيا'),
    ('Seychelles', 'سيشل'),
    ('Sierra Leone', 'سيراليون'),
    ('Singapore', 'سنغافورة'),
    ('Slovakia', 'سلوفاكيا'),
    ('Slovenia', 'سلوفينيا'),
    ('Solomon Islands', 'جزر سليمان'),
    ('Somalia', 'الصومال'),
    ('South Africa', 'جنوب أفريقيا'),
    ('South Korea', 'كوريا الجنوبية'),
    ('South Sudan', 'جنوب السودان'),
    ('Spain', 'إسبانيا'),
    ('Sri Lanka', 'سريلانكا'),
    ('Sudan', 'السودان'),
    ('Suriname', 'سورينام'),
    ('Sweden', 'السويد'),
    ('Switzerland', 'سويسرا'),
    ('Syria', 'سوريا'),
    ('Tajikistan', 'طاجيكستان'),
    ('Tanzania', 'تنزانيا'),
    ('Thailand', 'تايلاند'),
    ('Timor-Leste', 'تيمور الشرقية'),
    ('Togo', 'توغو'),
    ('Tonga', 'تونغا'),
    ('Trinidad and Tobago', 'ترينيداد وتوباغو'),
    ('Tunisia', 'تونس'),
    ('Turkey', 'تركيا'),
    ('Turkmenistan', 'تركمانستان'),
    ('Tuvalu', 'توفالو'),
    ('Uganda', 'أوغندا'),
    ('Ukraine', 'أوكرانيا'),
    ('United Arab Emirates', 'الإمارات العربية المتحدة'),
    ('United Kingdom', 'المملكة المتحدة'),
    ('United States of America', 'الولايات المتحدة الأمريكية'),
    ('Uruguay', 'أوروغواي'),
    ('Uzbekistan', 'أوزبكستان'),
    ('Vanuatu', 'فانواتو'),
    ('Vatican City', 'الفاتيكان'),
    ('Venezuela', 'فنزويلا'),
    ('Vietnam', 'فيتنام'),
    ('Yemen', 'اليمن'),
    ('Zambia', 'زامبيا'),
    ('Zimbabwe', 'زيمبابوي'),
]

Governments = [
    'اللجنة الشعبية العامة',
    'الحكومة الليبية الانتقالية',
    'حكومة الإنقاذ الوطني',
    'حكومة الوفاق الوطني',
    'الحكومة الليبية المؤقتة',
    'حكومة الاستقرار الوطني',
    'حكومة الوحدة الوطنية',
]

ComTypes = [
    'تجارية',
    'صناعية',
    'صناعية - تجارية'
]

DocTypes = [
    'تشريع',
    'نموذج',
    'لائحة'
]

DecreeCategories = [
    ('1', 'المواد الكيميائية المستخدمة في الصناعة والبحث العلمي والتصوير الفوتوغرافي وكذلك في الزراعة والبستنة وزراعة الغابات، راتنجات اصطناعية غير معالجة، مواد بلاستيكية غير معالجة، تركيبات إطفاء الحريق والوقاية من الحرائق، مستحضرات التقسية واللحام، مواد دباغة جلود الحيوانات، مواد لاصقة للاستخدام في الصناعة، المعاجين، مواد الحشو الأخرى، السماد والأسمدة، مستحضرات بيولوجية للاستخدام في الصناعة والعلوم'),
    ('2', 'الدهانات البويات والورنيش واللاكيه، مواد الوقاية من الصدأ ومواد حفظ الخشب من التلف، مواد التلوين والأصباغ، مواد تثبيت الألوان، أحبار الطباعة والتعليم والنقش، راتنجات طبيعية خام، معادن في شكل رقائق أو مسحوق للاستخدام في الدهن والديكور والطباعة والأعمال الفنية'),
    ('3', 'مستحضرات تجميل غير طبية، ومستحضرات العناية الشخصية، منظفات الأسنان غير الطبية، عطور وزيوت عطرية، مستحضرات قصر الأقمشة، ومواد أخرى تستعمل في غسل وكي الملابس، مستحضرات التنظيف والصقل والجلي والكشط'),
    ('4', 'زيوت وشحوم صناعية، شمع، مزلقات، مركبات امتصاص وترطيب وتثبيت الغبار، وقود ومواد إضاءة، شموع وفتائل للإضاءة'),
    ('5', 'مستحضرات صيدلية وبيطرية وصحية، مستحضرات صحية لغايات طبية، اغذية ومواد حمية معدة للإستعمال الطبي أو البيطري، وأغذية للرضع، مكملات غذائية للبشر والحيوانات، لصقات ومواد ضماد، مواد حشو الأسنان وشمع طب الأسنان، مطهرات، مستحضرات لإبادة الهوام الحشرات، الطيور والحيوانات الضارة، مبيدات الفطريات ومبيدات الأعشاب'),
    ('6', 'معادن غير نفيسة وكل خليط منها، خامات معادن، مواد بناء معدنية، مباني متنقلة معدنية، حبال وأسلاك غير كهربائية من معادن غير نفيسة، خردوات معدنية صغيرة، حاويات معدنية للتخزين أو النقل، خزائن حفظ الوثائق والأشياء الثمينة'),
    ('7', 'آلات وعدد آلية مدارة بالطاقة، محركات ومكائن عدا ما كان منها للمركبات البرية، قارنات آلية وعناصر نقل الحركة عدا ما كان منها للمركبات البرية، معدات زراعية عدا ما يدار باليد، اجهزة تفقيس البيض، آلات بيع الآلي'),
    ('8', 'عدد وأدوات يدوية تدار باليد أدوات قطع الشوك والسكاكين والملاعق، أسلحة بيضاء باستثناء الأسلحة النارية، أدوات حلاقة'),
    ('9', 'الأجهزة والادوات العلمية والملاحية و المساحية وأجهزة وأدوات التصوير الفوتوغرافي والسينمائي والأجهزة والأدوات البصرية وأجهزة وأدوات الوزن والقياس والإشارة والمراقبة الإشراف والإنقاذ والتعليم، أجهزة وأدوات لوصل أو فتح أو تحويل أو تكثيف أو تنظيم أو التحكم في الطاقة الكهربائية، أجهزة تسجيل أو إرسال أو نسخ الصوت أو الصور، حاملات بيانات مغناطيسية، أقراص تسجيل، ماكينات بيع آلية وآليات للأجهزة التي تعمل بقطع النقد، آلات تسجيل النقد، آلات حاسبة، معدات وأجهزة كمبيوتر لمعالجة البيانات، حواسيب، وأجهزة الحواسيب الطرفية، بدلات الغوص، أقنعة الغواصين، سدادات الأذن للغواصين، والسباحين، قفازات الغواصين، أجهزة تنفس للسباحة تحت الماء، أجهزة إخماد النيران'),
    ('10', 'أجهزة وأدوات جراحية وطبية وطب أسنان، وبيطرية، أطراف وعيون وأسنان اصطناعية، أدوات تجبير، مواد خياطة أو درز الجروح، الأجهزة العلاجية وأجهزة المساعدة المعدة للأشخاص ذوي الإعاقة، أجهزة التدليك، ومواد معدة لرعاية الأطفال'),
    ('11', 'اجهزة للإنارة والتدفئة وتوليد البخار والطهي والتبريد والتجفيف والتهوية وتوريد المياه والاغراض الصحية'),
    ('12', 'المركبات وأجهزة النقل البري والجوي والمائي'),
    ('13', 'فئة محظورة لحظر استيراد السلع الواردة بها في الأصل على الجهات الخاصة'),
    ('14', 'المعادن النفيسة وكل خليط منها، المجوهرات والأحجار الكريمة وشبه الكريمة، وأدوات قياس الوقت وأدوات قياس الوقت الدقيقة'),
    ('15', 'الآلات الموسيقية عدا الآلات المتكلمة والأجهزة اللاسلكية'),
    ('16', 'الورق والورق المقوى، المطبوعات، مواد تجليد الكتب، الصور الفوتوغرافية، القرطاسية، المواد المكتبية عدا الأثاث،مواد اللصق المستعملة في القرطاسية او لغايات منزلية، مواد الرسم ومواد الفنانين، فراشي الدهان او التلوين، مواد التوجيه والتدريس، الرقائق والأغطية والأكياس البلاستيكية، حروف الطباعة، قوالب الطباعة'),
    ('17', 'المطاط والصمغ والاسبستوس والميكا والمنتجات المصنوعة من هذه المواد وغير واردة في فئات أخرى، مواد بلاستيكية متشكلة بالبثق للاستعمال في التصنيع، مواد التغليف والحشو والعزل، أنابيب مرنة غير معدنية'),
    ('18', 'الجلود المدبوغة وتقليد الجلود المدبوغة وجلود الحيوانات الخام أو المدبوغة، الصناديق والحقائب السفرية، المظلات والشماسي والعصي، السياط واطقم الحيوانات والسروج، أطواق وأرسنة وملابس الحيوانات'),
    ('19', 'مواد بناء غير معدنية، أنابيب قاسية غير معدنية للمباني، أسفلت وزفت وقار، مباني غير معدنية قابلة للنقل، نصب مجسمات غير معدنية'),
    ('20', 'الأثاث والمرايا وإطارات الصور، حاويات غير معدنية للتخزين والنقل، العظم أو القرن، أو عظم الحوت، أو الصدف الخام، أو شبه المصنع، المحار، المرشوم، الكهرمان الأصفر'),
    ('21', 'أدوات وأواني وأوعية للاستعمال المنزلي وللمطبخ، أدوات الطبخ وأدوات المائدة باستثناء الشوك والسكاكين والملاعق، أمشاط واسفنج، فراشي عدا فراشي التلوين أو الدهان، مواد صنع الفراشي، أدوات للتنظيف، زجاج خام، أو شبه مصنع بخلاف الزجاج المستعمل في المباني، أواني زجاجية وأواني خزف صيني وأواني خزفية غير واردة في فئات أخرى'),
    ('22', 'الحبال والخيوط والشباك والخيام والمظلات والأقمشة المشمعة، مظلات من الأنسجة أو من مواد تركيبية، والأشرعة والأكياس للنقل وتخزين المواد بكميات كبيرة، مواد التبطين والحشو عدا ما كان من الورق أو الورق المقوى أو المطاط أو البلاستيك، مواد نسيج من الألياف الخام'),
    ('23', 'الغزل والخيوط المستخدمة في النسيج'),
    ('24', 'المنسوجات ومنتجات النسيج غير الواردة في فئات أخرى، أغطية الفراش والموائد'),
    ('25', 'الملابس ولباس القدم وأغطية الرأس'),
    ('26', 'المخرمات والأربطة والمطرزات والشرائط والجدائل، الأزرار والخطافات الكلابات والعراوي، الدبابيس والابر، الزهور الاصطناعية، الحلي للشعر، شعر صناعي'),
    ('27', 'السجاد والبسط والحصر ومفارش الحصير ومشمع فرش الأرضيات ومواد أخرى لتغطية الأرضيات القائمة، وما يعلق على الجدران لتزيينها من مواد غير نسيجية'),
    ('28', 'اللعب وأدوات اللعب، ألعاب الفيديو، أدوات الرياضة البدنية الجمباز والأدوات الرياضية غير الواردة في فئات أخرى، ورق اللعب شدة'),
    ('29', 'اللحوم والأسماك ولحوم الدواجن والصيد، خلاصات اللحم، فواكه وخضراوات محفوظة ومجففة ومطهوة، هلام جيلي ومربيات وفواكه مطبوخة بالسكر، البيض والحليب والجبن والزبدة، واللبن ومنتجات الألبان، الزيوت والدهون المعدة للأكل عدا لحوم وشحوم الخنازير و المنتجات الداخلة في صناعتها'),
    ('30', 'البن والشاي والكاكاو والسكر والأرز والبن الاصطناعي، الدقيق والمستحضرات المصنوعة من الحبوب والخبز والفطائر والحلويات، والآيس كريم، والشوكلا، عسل النحل والعسل الأسود، الخميرة ومسحوق الخبيز بايكن بودر، الملح والخردل والخل والصلصات التوابل، البهارات، الثلج، سكاكر للأكل'),
    ('31', 'المنتجات الزراعية ومنتجات تربية الأحياء المائية، والبساتين والغابات والغلال غير الواردة في فئات أخرى بحالتها الخام غير المعالجة والحبوب والبذور الخام غير المعالجة، الحيوانات الحية، الفواكه والخضراوات الطازجة، البذور والنباتات والزهور الطبيعية، المواد الغذائية الخاصة بالحيوانات، الشعير المنبت، الشتول والأشجار'),
    ('32', 'شراب الشعير والمياه المعدنية والغازية وغيرها من المشروبات غير الكحولية، مشروبات مستخلصة من الفواكه وعصائر الفواكه، شراب ومستحضرات أخرى لعمل المشروبات'),
    ('33', 'فئة محظورة لأسباب شرعية'),
    ('34', 'التبغ، ومواد التبغ، السجائر، والسيجار، السجائر الالكترونية، والمبخرات عن طريق الفم للمدخنين، وأدوات المدخنين والثقاب'),
    ('35', 'الدعاية والإعلان وإدارة الأعمال وتفعيل النشاط التجاري، الوظائف المكتبية'),
    ('36', 'خدمات التأمين، الشؤون المالية، الشؤون التمويلية، والشؤون العقارية'),
    ('37', 'إنشاء المباني والإصلاح وخدمات التركيب أو التجميع'),
    ('38', 'الاتصالات'),
    ('39', 'النقل وتغليف وتخزين السلع وتنظيم الرحلات والسفر'),
    ('40', 'معالجة المواد'),
    ('41', 'التعليم، التدريب، الترفيه، الأنشطة الرياضية والثقافية'),
    ('42', 'الخدمات العلمية والتقنية وخدمات البحث والتصميم المتعلقة بها، خدمات التحاليل والأبحاث الصناعية، خدمات تصميم وتطوير عتاد وبرامج الكمبيوتر'),
    ('43', 'خدمات توفير الأطعمة والمشروبات، وخدمات الإيواء المؤقت'),
    ('44', 'الخدمات الطبية، الخدمات البيطرية، خدمات العناية بالصحة والجمال للكائنات البشرية أو الحيوانات، خدمات الزراعة والبستنة والغابات'),
    ('45', 'خدمات قانونية، وخدمات شخصية واجتماعية يقدمها الغير تلبية لحاجات الأفراد'),
]


class Command(BaseCommand):
    help = 'Populates the Country, ComType, and DocType tables with predefined lists'

    def handle(self, *args, **kwargs):
        # Populate Countries
        for en_name, ar_name in Countries:
            if not Country.objects.filter(ar_name=ar_name).exists():
                country = Country(ar_name=ar_name, en_name=en_name)
                country.save()
                self.stdout.write(self.style.SUCCESS(f'Successfully added Country: {ar_name}'))
            else:
                self.stdout.write(self.style.WARNING(f'Country {ar_name} already exists'))

        # Populate ComTypes
        for name in Governments:
            if not Government.objects.filter(name=name).exists():
                government = Government(name=name)
                government.save()
                self.stdout.write(self.style.SUCCESS(f'Successfully added Government: {name}'))
            else:
                self.stdout.write(self.style.WARNING(f'Government {name} already exists'))

        # Populate ComTypes
        for name in ComTypes:
            if not ComType.objects.filter(name=name).exists():
                com_type = ComType(name=name)
                com_type.save()
                self.stdout.write(self.style.SUCCESS(f'Successfully added ComType: {name}'))
            else:
                self.stdout.write(self.style.WARNING(f'ComType {name} already exists'))

        # Populate DocTypes
        for name in DocTypes:
            if not DocType.objects.filter(name=name).exists():
                doc_type = DocType(name=name)
                doc_type.save()
                self.stdout.write(self.style.SUCCESS(f'Successfully added DocType: {name}'))
            else:
                self.stdout.write(self.style.WARNING(f'DocType {name} already exists'))

        # Populate DecreeCategories
        for number, name in DecreeCategories:
            if not DecreeCategory.objects.filter(number=number).exists():
                category = DecreeCategory(number=number, name=name)
                category.save()
                self.stdout.write(self.style.SUCCESS(f'Successfully added DecreeCategory: {name}'))
            else:
                self.stdout.write(self.style.WARNING(f'DecreeCategory {name} already exists'))
